---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.ClearFinishMaterials
source: html/ead3e7cf-76e8-eb9e-ab68-2105b54b2726.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.ClearFinishMaterials Method

Clear finish materials in this wrapper.

## Syntax (C#)
```csharp
public void ClearFinishMaterials()
```